bighappysmiley/Pocket/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
# Waveshare ESP32-S3-ePaper-3.97 ships ESP32-S3-WROOM-1-N16R8 (16MB flash + 8MB OPI PSRAM).
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_USE_MALLOC=y
# E-ink full refresh can exceed the default 5s task WDT.
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
